-- Необходимо: выбрать всех пользователей (user_id), 
-- которые впервые создали отчет в 2021-м году, и подсчитать 
-- сумму вознаграждений (reward) за 2022-й год в одном запросе.

CREATE TABLE reports 
(
    id int PRIMARY KEY,
    user_id int,
    reward int,
    created_at timestamp without time zone
);

-- Пример данных
INSERT INTO reports (id, user_id, reward, created_at) VALUES
(1, 1, 50, '2020-11-15'),
(2, 1, 75, '2020-12-10'),
(3, 2, 120, '2019-06-01'),
(4, 2, 80, '2020-05-23'),
(5, 3, 90, '2018-09-13'),
(6, 3, 110, '2020-03-27'),
(7, 4, 95, '2019-07-20'),
(8, 1, 100, '2021-01-15'),
(9, 2, 200, '2021-05-10'),
(10, 3, 100, '2021-06-25'),
(11, 4, 150, '2021-06-30'),
(12, 5, 200, '2021-03-14'),
(13, 6, 300, '2021-08-19'),
(14, 7, 100, '2021-04-10'),
(15, 8, 100, '2021-11-11'),
(16, 9, 150, '2021-09-09'),
(17, 10, 100, '2021-02-12'),
(18, 1, 150, '2022-02-20'),
(19, 2, 250, '2022-03-22'),
(20, 3, 100, '2022-01-10'),
(21, 4, 100, '2022-02-28'),
(22, 5, 180, '2022-05-01'),
(23, 6, 150, '2022-05-10'),
(24, 7, 200, '2022-10-05'),
(25, 8, 250, '2022-07-22'),
(26, 9, 100, '2022-03-15'),
(27, 10, 50, '2022-04-18'),
(28, 2, 300, '2023-02-10'),
(29, 5, 220, '2023-08-25'),
(30, 11, 400, '2023-09-17'),
(31, 3, 120, '2024-01-08'),
(32, 8, 150, '2024-06-22');


SELECT user_id, 
    SUM(reward) as total_reward_2022
FROM reports
where user_id in (
    SELECT user_id
    FROM reports
    GROUP BY user_id
    HAVING MIN(
        EXTRACT(YEAR FROM created_at)
    ) = 2021 
)
AND EXTRACT(YEAR FROM created_at) = 2022
GROUP BY user_id